# Dataframes con el módulo `pandas`

## Introducción

**Dataframe.** Es una estructura bidimensional mutable de datos con los ejes etiquetados donde

- cada fila representa una observación diferente
- cada columna representa una variable diferente

En `Python`, para definir un dataframe, en primer lugar necesitamos importar el módulo `pandas`.

In [1]:
import pandas as pd

A continuación, si queremos un dataframe de 5 filas y 2 columnas, podemos hacerlo a partir de un diccionario, una lista de listas, una lista de diccionarios, etc.

---

#### Ejemplo 1

Vamos a crear un dataframe de 5 filas y 2 columnas a partir de un diccionario.

Para ello, primero creamos un diccionario donde las claves serán los nombres de las columnas y los valores serán listas, con tantos elementos como número de filas queramos.

Finalmente, convertimos ese diccionario a dataframe con la función `DataFrame()` de `pandas`:

In [3]:
data = {"x": [1, 2, 3, 4, 5], "y": [2, 4, 6, 8, 10]} #ambos valores deben tener la misma cantidad de elementos en su arreglo o lista
df1 = pd.DataFrame(data = data)
print(df1)

   x   y
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10

Como habíamos dicho, hemos creado un dataframe de 5 filas y dos columnas, llamadas `x` e `y` respectivamente.

**Observación.** Como resultado del `print()`, no solamente hemos obtenido las 5 filas y 2 columnas, sino que hay una columna adicional de 5 números ordenados verticalmete del 0 al 4. Se trata simplemente del nombre de cada fila, que por defecto es el índice de cada fila. El 0 indica la primera fila; el 1, la segunda; y así, sucesivamente.

---

#### Ejemplo 2

Vamos a crear el mismo dataframe de 5 filas y 2 columnas, pero esta vez a partir de una lista de listas.

En este caso, podemos hacerlo directamente con la función `DataFrame()` de `pandas`, usando los parámetros `data` y `columns`

In [ ]:
# lista de listas
df2 = pd.DataFrame(data = [[1, 2], [2, 4], [3, 6], [4, 8], [5, 10]], # son los valores de cada fila
                   columns = ["x", "y"])
print(df2)

   x   y
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10

Al parámetro `data` le hemos proporcionado una lista de 5 listas, donde cada una de las sublistas tiene 2 elementos: el perteneciente a la primera columna en la posición 0, y el perteneciente a la segunda columna en la posición 1.

Al parámetro `columns` le hemos proporcionado el nombre de las 2 columnas.

---

#### Ejemplo 3

Vamos a crear el mismo dataframe de 5 filas y 2 columnas, con la diferencia de que vamos a modificar el nombre de las filas.

Lo haremos a partir del diccionario `data` y utilizaremos el parámetro `index` de la función `DataFrame()` de `pandas`

In [4]:
# añadimos un parámetros adicional(index) que es una lista que serán los indices de las filas
df3 = pd.DataFrame(data = data, index = ["obs1", "obs2", "obs3", "obs4", "obs5"])
print(df3)

      x   y
obs1  1   2
obs2  2   4
obs3  3   6
obs4  4   8
obs5  5  10

En este caso, al parámetro `index` le hemos pasado una lista con 5 strings.

**¡Cuidado!.** Al construir un dataframe a partir de un diccionario (o cualquier objeto de `Python` que contenga algún diccionario), los nombres de las columnas son las claves del diccionario. Si quisiésemos cambiarlos con el parámetro `columns` directamente, nos pasaría lo siguiente:

In [5]:
d = {"a": [1, 2, 3],
     "b": [4, 5, 6],
     "b1": [7, 8, 9]} # las columnas son a,b y b1

# es incompatible tener un diccionario como datos e intentar cambiar el nombre de algunas de las columnas
# este nombre ya viene en diccionario, no podemos cambiarlo
# asi que vamos a crear un df a partir de un diccionario no podremos cambiar el nombre de la columna inicialmente
df = pd.DataFrame(d, columns = ["a", "b", "c"]) 
print(df)

   a  b    c
0  1  4  NaN
1  2  5  NaN
2  3  6  NaN

**Observación.** Si queremos crear un dataframe a partir de un diccionario, pero queremos menos columnas que total de claves que tiene el diccionario, no hay problema, siempre y cuando los nombres de las columnas indicados coincidan con las claves del diccionario

In [ ]:
# Construimos un dataframe solo con las columnas a y b del diccionario d
# con columns podemos indicar que columnas queremos que se almacenen en el dataframe
df = pd.DataFrame(d, columns = ["a", "b"]) 
print(df)

   a  b
0  1  4
1  2  5
2  3  6

---

#### Ejemplo 4

Vamos a crear el mismo dataframe de 5 filas y 2 columnas, esta vez a partir de una lista de diccionarios.

In [ ]:
# lista de diccionario, cada diccionario tiene dos valores con las misma claves y cantidad de elmentos, 
# para que puedan estructurarse de forma correcta
data = [{"x": 1, "y": 2},
        {"x": 2, "y": 4},
        {"x": 3, "y": 6},
        {"x": 4, "y": 8},
        {"x": 5, "y": 10}]
df4 = pd.DataFrame(data = data)
print(df4)

   x   y
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10

---

#### Ejemplo 5

Incluso podemos crear un dataframe haciendo uso de la función `zip()`.

Para ello, a partir de dos listas, creamos una lista de tuplas, que es la que proporcionamos al parámetro `data` de la función `DataFrame()` para construir el dataframe.

In [7]:
x = [1, 2, 3, 4, 5]
y = [2, 4, 6, 8, 10]

data = list(zip(x, y)) # con zip convertimos a tuplas y envolvemos todo como una lista
print(data) # lista de tuplas

[(1, 2), (2, 4), (3, 6), (4, 8), (5, 10)]

In [9]:
# convertimos la lista de tuplas, le asignamos un nombre para las columnas, 
# sino colocamos el nombre por defecto serán 0 y 1
df5 = pd.DataFrame(data, columns = ["x", "y"])
print(df5)

   0   1
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10

---

### Creando dataframes con `.from_dict()`

Para construir dataframes a partir de un diccionario, existe el método `.from_dict()`

In [ ]:
d = {"a": [1, 2, 3],
     "b": [4, 5, 6],
     "b1": [7, 8, 9]}
# hasta aquí no hay difencias con hacerlo sin from_dict
df = pd.DataFrame.from_dict(d)
print(df)

   a  b  b1
0  1  4   7
1  2  5   8
2  3  6   9

Lo interesante de este método es que podemos crear un dataframe a partir de un diccionario donde cada clave represente una fila (observación) diferente, gracias al parámetro `orient`

In [ ]:
d = {"fila1": [1, 4, 7],
     "fila2": [2, 5, 8],
     "fila3": [3, 6, 9]}
# podemos añadir el parametro orient, que puede ser 'index'(por defecto es 'column') 
# para indicar que las claves ahora son indices(filas).
df = pd.DataFrame.from_dict(d, orient = "index", columns = ["A", "B", "C"])
print(df)

       A  B  C
fila1  1  4  7
fila2  2  5  8
fila3  3  6  9

**¡Cuidado!** Para poder usar el parámetro `columns` del método `.from_dict()`, necesitamos que el parámetro `orient` valga `"index"`.

**Observación.** Si no indicásemos el parámetro `orient`, por defecto vale `"columns"`, con lo cual el diccionario suministrado a `data` sería interpretado del siguiente modo: cada clave representaría una columna diferente, tal cual ocurría cuando no usábamos el método `.from_dict()`. Si por el contrario indicamos que `orient = "index"`, lo que estamos haciendo es decirle a `Python` que cada clave del diccionario representa una fila (observación) diferente.

### Dimensiones del dataframe

Con el método `.shape` podemos calcular las dimensiones (número de filas y columnas) del dataframe.

In [ ]:
df.shape # shape o forma

(3, 3)

Como resultado obtenemos una tupla donde el primer elemento es el número de filas, que en nuestro caso es 3, mientras que el segundo elemento es el número de columnas, que en nuestro ejemplo era 3.

In [ ]:
# al ser una tupla podemos acceder a sus elementos
nrows = df.shape[0] # filas
ncols = df.shape[1] # columnas
print("El número de filas de df es", nrows)
print("El número de columnas de df es", ncols)

El número de filas de df es 3
El número de columnas de df es 3

Con el método `.size` calculamos el número total de valores que tienes el dataframe (número de filas por número de columnas)

In [ ]:
df.size # seria filas x columnas

9

In [ ]:
df.shape[0] * df.shape[1] == df.size # comparación

True

Finalmente, con el método `.ndim` calculamos el número de dimensiones que tiene el dataframe. Éste siempre valdrá 2, pues consta de filas y columnas.

In [ ]:
df.ndim # siempre valdrá 2, porque esta compuesta de filas y columnas(2 dimensiones).
# Existen otro tipo de estructuras con más dimensiones

2

## Subdataframes

**Subdataframe.** Dado un dataframe, un subdataframe no es más que la selección de unas filas y columnas en particular, es decir, un subconjunto del dataframe.

### Columnas

Dado un dataframe, podemos seleccionar una columna en particular de diversas formas:

- Indicando el nombre de la columna entre claudators, `[]`
- Con el método `.columns[]`
- Con el método `.loc[]` (por nombre o etiqueta)
- Con el método `.iloc[]` (por posición) (iloc es index location)

In [10]:
fdata = {"Name": ["Alicia", "Bill", "Carlos", "Diana"], # dicionario de listas, cada lista con 4 valores
        "Age": [22, 28, 19, 34],
        "Pet": [True, False, False, True],
        "Height": [157, 190, 175, 164],
        "Birthday": ["Mayo", "Junio", "Agosto", "Diciembre"]}
df = pd.DataFrame(data = fdata, index = ["obs1", "obs2", "obs3", "obs4"]) # colocamos un indice o nombre a las filas

In [11]:
df

        Name  Age    Pet  Height   Birthday
obs1  Alicia   22   True     157       Mayo
obs2    Bill   28  False     190      Junio
obs3  Carlos   19  False     175     Agosto
obs4   Diana   34   True     164  Diciembre

In [12]:
print(df)

        Name  Age    Pet  Height   Birthday
obs1  Alicia   22   True     157       Mayo
obs2    Bill   28  False     190      Junio
obs3  Carlos   19  False     175     Agosto
obs4   Diana   34   True     164  Diciembre

In [ ]:
# Seleccionamos la columna Birthday por nombre
print(df["Birthday"])

obs1         Mayo
obs2        Junio
obs3       Agosto
obs4    Diciembre
Name: Birthday, dtype: object

In [13]:
# Seleccionamos la columna Birthday con el método .columns[], dentro del df
# esto usado normalmente para iterar las columnas del dataframe
print(df.columns[4]) # imprime el titulo de la columna
print(df[df.columns[4]])

Birthday
obs1         Mayo
obs2        Junio
obs3       Agosto
obs4    Diciembre
Name: Birthday, dtype: object

In [ ]:
# Seleccionamos la columna Birthday con el método .loc[]
# loc, para localizar la columna, entre corchetes se indica el indice(s) de las filas y
# el indice de las columnas que queremos seleccionar
# : significa todas las filas y se selecciona la columna "Birthday"
print(df.loc[:, "Birthday"])

obs1         Mayo
obs2        Junio
obs3       Agosto
obs4    Diciembre
Name: Birthday, dtype: object

**Observación.** Al método `.loc[]` le hemos indicado que tome todas las filas con `:` en la primera posición y la columna `"Birthday"` directamente indicando su nommbre en la segunda posición.

In [ ]:
# Seleccionamos la columna Birthday con el método .iloc[]
# con iloc se hace lo mismo que .loc, pero aquí indicamos el indice en vez del nombre
print(df.iloc[:, 4])

0         Mayo
1        Junio
2       Agosto
3    Diciembre
Name: Birthday, dtype: object

**Observación.** Al método `.iloc[]` le hemos indicado que tome todas las filas con `:` en la primera posición y la columna `"Birthday"` indicando el índice que ocupa como columna.

### Seleccionamos varias columnas

Si quisiésemos seleccionar más de una columna, podríamos hacerlo con todas las opciones enumeradas anteriormente, con ligeras modificaciones en algunos casos:

Lo hacemos mediante una lista de string con los nombres o un lista de los indices númericos o usar los : para indicar rango númerico

In [ ]:
# Seleccionamos las columnas Name y Age por nombre
print(df[["Name", "Age"]])

        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

In [14]:
# Seleccionamos las columnas Name y Age con el método .columns[]
print(df.columns[[0, 1]]) # restorna una lista con el nombre de las columnas seleccionadas
print(df[df.columns[[0, 1]]])

Index(['Name', 'Age'], dtype='object')
        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

**Observación.** Además, como estas dos columnas están seguidas en nuestro dataframe, podríamos también usar la sintaxis siguiente no solo en esta opción, sino también en el resto de opciones que hemos visto.

In [ ]:
print(df[df.columns[0:2]]) # rango de 0 a 1, no incluye el 2

        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

In [ ]:
# Seleccionamos las columnas Name y Age con el método .loc[]
print(df.loc[:, ["Name", "Age"]])

        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

In [ ]:
print(df.loc[:, "Name":"Age"])# tambien se puede indicar rango, este si incluye ambos extremos, esto por ser string
# para rango númerico no se incluye el último valor

        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

**¡Cuidado!** Como podemos ver, al usar `:` con strings, el indicado a la derecha sí que es incluido.

In [ ]:
# Seleccionamos las columnas Name y Age con el método .iloc[]
print(df.iloc[:, [0, 1]])

        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

In [ ]:
print(df.iloc[:, 0:2]) # los rango para números, de 0 a 1, no se incluye el 2

        Name  Age
obs1  Alicia   22
obs2    Bill   28
obs3  Carlos   19
obs4   Diana   34

## Filas

Dado un dataframe, podemos seleccionar una fila en particular de diversas formas:

Como vimos, podemos seleccionar filas desde .loc y .iloc, como primer parámetro ambos reciben las filas

- Con el método `.loc[]` (por nombre o etiqueta)
- Con el método `.iloc[]` (por posición)

In [15]:
# Seleccionamos la primera observación (obs1) con el método .loc[]
print(df.loc["obs1"])
# retorna un valor tipo object, parecido a un diccionario, por alamacenar valores de distinto tipom pero sin llegar a serlo

Name        Alicia
Age             22
Pet           True
Height         157
Birthday      Mayo
Name: obs1, dtype: object

In [ ]:
type(df.loc["obs1"]) # tipo de objeto Series

pandas.core.series.Series

In [ ]:
# Seleccionamos la última observación con el método .iloc[]
# -1 es la ultima fila
print(df.iloc[-1])

Name            Diana
Age                34
Pet              True
Height            164
Birthday    Diciembre
Name: obs4, dtype: object

### Seleccionamos varias filas

Si quisiésemos seleccionar más de una fila, podríamos hacerlo con todas las opciones enumeradas anteriormente, con ligeras modificaciones en algunos casos:

In [ ]:
# Seleccionamos la segunda y tercera observación con el método .loc[]
print(df.loc[["obs2","obs3"]]) # pasamos una lista de indices de fila

        Name  Age    Pet  Height Birthday
obs2    Bill   28  False     190    Junio
obs3  Carlos   19  False     175   Agosto

**Observación.** Además, como estas dos filas están seguidas en nuestro dataframe, podríamos también usar la sintaxis siguiente no solo en esta opción, sino también en el resto de opciones que hemos visto.

In [ ]:
print(df.loc["obs2":"obs3"]) # tambien se puede hacer por rango

        Name  Age    Pet  Height Birthday
obs2    Bill   28  False     190    Junio
obs3  Carlos   19  False     175   Agosto

In [ ]:
# Seleccionamos la segunda y tercera observación con el método .iloc[]
print(df.iloc[[1, 2]]) # lista de números

        Name  Age    Pet  Height Birthday
obs2    Bill   28  False     190    Junio
obs3  Carlos   19  False     175   Agosto

In [ ]:
print(df.iloc[1:3]) # en rango número, el 3 no se incluye (el último)

        Name  Age    Pet  Height Birthday
obs2    Bill   28  False     190    Junio
obs3  Carlos   19  False     175   Agosto

## Filas y columnas

Para seleccionar un elemento en concreto, hay que indicar la fila y la columna y lo podemos hacer de dos formas:

- Con el método `.loc[]` (por nombre o etiqueta)
- Con el método `.iloc[]` (por índice) númerico

In [ ]:
# Seleccionamos la edad de la segunda observación con el método .loc[]
# primero se indica la fila, luego la columna
print(df.loc["obs2", "Age"])

28

In [ ]:
# Seleccionamos la edad de la segunda observación con el método .iloc[]
print(df.iloc[1, 1])

28

Si queremos seleccionar un subconjunto de filas y columnas, podemos utilizar los dos métodos anteriores

In [ ]:
# Seleccionamos la segunda y tercera fila y las columnas nombre y cumpleaños
# Con el método .loc[]
# rango de filas y lista de columnas
print(df.loc["obs2":"obs3", ["Name", "Birthday"]])

        Name Birthday
obs2    Bill    Junio
obs3  Carlos   Agosto

In [ ]:
# Con el método .iloc[]
# con indices númericos
print(df.iloc[1:3, [0, 4]])

        Name Birthday
obs2    Bill    Junio
obs3  Carlos   Agosto

## Métodos de dataframes

El método `.head()` sirve para visualizar las primeras filas del dataframe. Por defecto, se nos mostrarán las 5 primeras

In [16]:
import pandas as pd

In [25]:
# cantidad de frutas
d = {"fruit": ["sandía", "melón", "manzana", "cerezas", "plátano", "pera", "melocotón", "fresas"],
     "count": [1, 1, 6, 10, 3, 6, 4, 10]}

df = pd.DataFrame(d)

In [26]:
df.head() # vemos los 1ros 5 elementos por defecto

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6
3  cerezas     10
4  plátano      3

Si queremos que se nos muestre un número determinado de filas, tenemos que indicarlo por parámetro:

In [ ]:
df.head(3)

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6

In [ ]:
df.head(6)

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6
3  cerezas     10
4  plátano      3
5     pera      6

El método `.tail()` sirve para visualizar las últimas filas del dataframe. Por defecto, se nos mostrarán las 5 últimas

In [ ]:
df.tail() # por defecto muestra las 5 ultimas

       fruit  count
3    cerezas     10
4    plátano      3
5       pera      6
6  melocotón      4
7     fresas     10

Si queremos que se nos muestre un número determinado de filas, tenemos que indicarlo por parámetro:

In [ ]:
df.tail(3)

       fruit  count
5       pera      6
6  melocotón      4
7     fresas     10

In [ ]:
df.tail(6)

       fruit  count
2    manzana      6
3    cerezas     10
4    plátano      3
5       pera      6
6  melocotón      4
7     fresas     10

El método `.copy()` nos sirve para realizar una copia de un dataframe.

Si simplemente realizamos

In [27]:
fruits = df # esto no genera una copia, solo una referencia al mismo df
# si realizamos una modificación en cualquiera, se verá reflejado en el otro

El dataframe llamado `fruits` es solo una referencia del dataframe original `df` pues si realizamos algún cambio en `fruits`, se realiza también en `df`

In [28]:
fruits.iloc[6, 0] = "naranja"
fruits

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6
3  cerezas     10
4  plátano      3
5     pera      6
6  naranja      4
7   fresas     10

In [29]:
df

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6
3  cerezas     10
4  plátano      3
5     pera      6
6  naranja      4
7   fresas     10

En cambio, si `fruits` es definido como

In [30]:
fruits = df.copy() # copy si realiza una copia como tal

entonces ahora sí es una copia independiente del dataframe original y por muchos cambios que hagamos sobre dicha copia, el original se mantiene intacto

In [31]:
fruits.iloc[6, 0] = "nectarina"
fruits

       fruit  count
0     sandía      1
1      melón      1
2    manzana      6
3    cerezas     10
4    plátano      3
5       pera      6
6  nectarina      4
7     fresas     10

In [ ]:
df

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6
3  cerezas     10
4  plátano      3
5     pera      6
6  naranja      4
7   fresas     10

El método `.rename()` se puede utilizar tanto para cambiar las etiquetas de las filas como los nombres de las columnas. 

**¡Cuidado!** Para que los cambios se guarden en el dataframe original, necesitamos indicar `inplace = True`, de lo contrario, lo único que estamos haciendo es duplicar el dataframe, cambiando el nombre de las filas o columnas

In [32]:
# cambiamos el nombre de las columnas, pero como no colocamos inplace = True no se guarda en el df original
df.rename(columns = {"fruit": "fruta",
                     "count": "cantidad"})
df # vemos que no se cambia el nombre, no se guarda en el original

     fruit  count
0   sandía      1
1    melón      1
2  manzana      6
3  cerezas     10
4  plátano      3
5     pera      6
6  naranja      4
7   fresas     10

In [ ]:
# Esto seria una solución si no usamos inplace = True
# df = df.rename(columns = {"fruit": "fruta", "count": "cantidad"})

In [33]:
# Cambiamos el nombre de las columnas al dataframe original
df.rename(columns = {"fruit": "fruta",
                     "count": "cantidad"},
          inplace = True) # se guardará en el original
df

     fruta  cantidad
0   sandía         1
1    melón         1
2  manzana         6
3  cerezas        10
4  plátano         3
5     pera         6
6  naranja         4
7   fresas        10

In [34]:
# renombramos las filas, de igual forma sino colocamos inplace = True nose guardan los cambios en el original
df.rename(index = {0: "obs1",
                   1: "obs2",
                   7: "obs8"})
df

     fruta  cantidad
0   sandía         1
1    melón         1
2  manzana         6
3  cerezas        10
4  plátano         3
5     pera         6
6  naranja         4
7   fresas        10

In [35]:
# Cambiamos el nombre de las filas al dataframe original
df.rename(index = {0: "obs1",
                   1: "obs2",
                   7: "obs8"},
          inplace = True)
df

        fruta  cantidad
obs1   sandía         1
obs2    melón         1
2     manzana         6
3     cerezas        10
4     plátano         3
5        pera         6
6     naranja         4
obs8   fresas        10

Con el método `.columns` también podemos cambiar el nombre de las columnas:

In [ ]:
df.columns

Index(['fruta', 'cantidad'], dtype='object')

In [36]:
# podemos cambiar el nombre de las columnas más facilmente
# cambia el nombre de acuerdo a su posición
df.columns = ["FRUTA", "CANTIDAD"]
df

        FRUTA  CANTIDAD
obs1   sandía         1
obs2    melón         1
2     manzana         6
3     cerezas        10
4     plátano         3
5        pera         6
6     naranja         4
obs8   fresas        10

El método `.insert()` inserta una nueva columna a un dataframe existente

In [37]:
# loc: es el indice o posición donde se insertar, en este caso lo insertamos al ultimos, pero podemos ponerla en cualquier otra posición
# column: Nombre de la columna
# value: valores de la nueva columna
df.insert(loc = 2, column = "PRECIO", value = [2.50, 2.00, 0.35, 0.10, 0.35, 0.20, 0.15, 0.05])
df

        FRUTA  CANTIDAD  PRECIO
obs1   sandía         1    2.50
obs2    melón         1    2.00
2     manzana         6    0.35
3     cerezas        10    0.10
4     plátano         3    0.35
5        pera         6    0.20
6     naranja         4    0.15
obs8   fresas        10    0.05

Al parámetro `loc` le indicamos el índice que ocupará la nueva columna; al parámetro `column` le pasamos el nombre de la nueva columna; y al parámetro `value`, los valores para cada una de las filas.

**Observación.** Si al parámetro `loc` le pasamos un índice ya ocupado por otra columna, se desplazan la columna existente y las de índices superiores un índice a la derecha.

**Observación.** Si al parámetro `value` solo le pasamos un valor, éste será el mismo para todas las filas

In [38]:
# podemos colocar los parametros sin asignarlos
# como insertamos un solo valor, estos se repiten en todos las filas
df.insert(1, "COLOR", "rojo")
df

        FRUTA COLOR  CANTIDAD  PRECIO
obs1   sandía  rojo         1    2.50
obs2    melón  rojo         1    2.00
2     manzana  rojo         6    0.35
3     cerezas  rojo        10    0.10
4     plátano  rojo         3    0.35
5        pera  rojo         6    0.20
6     naranja  rojo         4    0.15
obs8   fresas  rojo        10    0.05

El método `.drop()` nos permite borrar las filas o columnas que indiquemos

**¡Cuidado!** De nuevo, si queremos aplicar directamente los cambios al dataframe original, necesitamos indicar `inplace = True`

In [39]:
# Eliminamos filas (axis = 0) por etiqueta
# podemos asignar el df a otra variable para no eliminar los datos que tenemos
# labels son la lista de filas, será la fila llamada "obs1" y 4
# axis = 1 son las columnas y = 0 son las filas
df_dropped = df.drop(labels = ["obs1", 4], axis = 0)
df_dropped

        FRUTA COLOR  CANTIDAD  PRECIO
obs2    melón  rojo         1    2.00
2     manzana  rojo         6    0.35
3     cerezas  rojo        10    0.10
5        pera  rojo         6    0.20
6     naranja  rojo         4    0.15
obs8   fresas  rojo        10    0.05

In [40]:
# Eliminamos columnas (axis = 1) por etiqueta
# axis=1 son las columnas
# labels, es la lista con las columnas a borrar
df_dropped = df.drop(labels = ["COLOR", "PRECIO"], axis = 1)
df_dropped

        FRUTA  CANTIDAD
obs1   sandía         1
obs2    melón         1
2     manzana         6
3     cerezas        10
4     plátano         3
5        pera         6
6     naranja         4
obs8   fresas        10

El método `.pop()` elimina la columna que indiquemos por parámetro

In [41]:
column_popped = df.pop("COLOR") # column_popped guarda los valores de la columna borrada
df # se elimina la columna del df original

        FRUTA  CANTIDAD  PRECIO
obs1   sandía         1    2.50
obs2    melón         1    2.00
2     manzana         6    0.35
3     cerezas        10    0.10
4     plátano         3    0.35
5        pera         6    0.20
6     naranja         4    0.15
obs8   fresas        10    0.05

In [ ]:
column_popped

obs1    rojo
obs2    rojo
2       rojo
3       rojo
4       rojo
5       rojo
6       rojo
obs8    rojo
Name: COLOR, dtype: object

In [42]:
# Volvemos a añadir la columna recientemente eliminada al final del dataframe con una sintaxis que no habíamos visto todavía
# COLOR no existe, por lo que, creamos esa columna con los valores eliminados
df["COLOR"] = column_popped
df

        FRUTA  CANTIDAD  PRECIO COLOR
obs1   sandía         1    2.50  rojo
obs2    melón         1    2.00  rojo
2     manzana         6    0.35  rojo
3     cerezas        10    0.10  rojo
4     plátano         3    0.35  rojo
5        pera         6    0.20  rojo
6     naranja         4    0.15  rojo
obs8   fresas        10    0.05  rojo

El método `.rank()` devuelve un ranking.

Si por ejemplo queremos un ranking por fruta, el método `.rank()` nos devolverá una columna de posiciones correspondientes a la posición que ocupa cada fruta si estas son ordenadas alfabéticamente

**Observación.** El ranking empieza siempre en 1.

In [43]:
df["RANKING_FRUTA"] = df["FRUTA"].rank() # posición de cada fruta ordenada alfabeticamente
df

        FRUTA  CANTIDAD  PRECIO COLOR  RANKING_FRUTA
obs1   sandía         1    2.50  rojo            8.0
obs2    melón         1    2.00  rojo            4.0
2     manzana         6    0.35  rojo            3.0
3     cerezas        10    0.10  rojo            1.0
4     plátano         3    0.35  rojo            7.0
5        pera         6    0.20  rojo            6.0
6     naranja         4    0.15  rojo            5.0
obs8   fresas        10    0.05  rojo            2.0

Con el parámetro `ascending`, que por defecto vale `True`, podemos indicar si queremos que el ranking sea en orden ascendente o descendente.

In [44]:
# orden descendente en el precio, el precio mayor = 1 y el menor = 8, 
# si tienen el mismo precio se coloca como decimal, como el 3.5 que esta entre 3 y 4
df["RANKING_PRECIO"] = df["PRECIO"].rank(ascending = False)
df

        FRUTA  CANTIDAD  PRECIO COLOR  RANKING_FRUTA  RANKING_PRECIO
obs1   sandía         1    2.50  rojo            8.0             1.0
obs2    melón         1    2.00  rojo            4.0             2.0
2     manzana         6    0.35  rojo            3.0             3.5
3     cerezas        10    0.10  rojo            1.0             7.0
4     plátano         3    0.35  rojo            7.0             3.5
5        pera         6    0.20  rojo            6.0             5.0
6     naranja         4    0.15  rojo            5.0             6.0
obs8   fresas        10    0.05  rojo            2.0             8.0

El método `.nunique()` devuelve el conteo de cuántos valores únicos hay en cada columna

In [ ]:
df.nunique()

FRUTA             8
CANTIDAD          5
PRECIO            7
COLOR             1
RANKING_FRUTA     8
RANKING_PRECIO    7
dtype: int64

Dada una columna de un dataframe, el método `.unique()` devuelve un array(lista) con los valores únicos de dicha columna

In [45]:
print(df["COLOR"].unique())

['rojo']

In [46]:
print(df["PRECIO"].unique())

[2.5  2.   0.35 0.1  0.2  0.15 0.05]

El método `.duplicated()` nos ayuda a analizar los valores duplicados. El parámetro `keep` sirve para controlar como proceder con los valores duplicados, los valores para `keep` son:

  * `first`: considera la primera aparición del valor repetido como único y el resto como duplicados
  * `last`: considera la última aparición del valor repetido como único y el resto como duplicados
  * `False`: considera todos los repetidos iguales como duplicados

In [47]:
# keep = False, se quedara con todos los elementos repetidos en la columna Cantidad
bool_duplicated = df["CANTIDAD"].duplicated(keep = False)
df[bool_duplicated] # mostramos el df solo los valores repetidos

        FRUTA  CANTIDAD  PRECIO COLOR  RANKING_FRUTA  RANKING_PRECIO
obs1   sandía         1    2.50  rojo            8.0             1.0
obs2    melón         1    2.00  rojo            4.0             2.0
2     manzana         6    0.35  rojo            3.0             3.5
3     cerezas        10    0.10  rojo            1.0             7.0
5        pera         6    0.20  rojo            6.0             5.0
obs8   fresas        10    0.05  rojo            2.0             8.0

In [48]:
bool_duplicated # 4 y 6 no son valores repetidos, ambos son únicos en cantidad

obs1     True
obs2     True
2        True
3        True
4       False
5        True
6       False
obs8     True
Name: CANTIDAD, dtype: bool

El método `.drop_duplicates()` elimina los duplicados del dataframe. De nuevo, volvemos a tener el parámetro `keep` y el parámetro `subset` sirve para indicar las columnas a las que queremos aplicar el método:

**Observación.** Para que los cambios sean llevados a cabo en el dataframe original, habrá que indicar `inplace = True`

In [ ]:
# subset se indica a que columna le eliminamos los duplicados
# keep, tiene los mismos valores que con .duplicated
# creamos un nuevo df para que guarde los valores con estos cambios
df_without_duplicates = df.drop_duplicates(subset = "CANTIDAD",
                                           keep = "first")
df_without_duplicates
# por el keep = "first" solo nos quedamos con el 1er elemento repetido en la columna CANTIDAD
# Sandia y melo tenian la misma cantidad, pero como sandia iba primero, nos quedamos con ese

        FRUTA  CANTIDAD  PRECIO COLOR  RANKING_FRUTA  RANKING_PRECIO
obs1   sandía         1    2.50  rojo            8.0             1.0
2     manzana         6    0.35  rojo            3.0             3.5
3     cerezas        10    0.10  rojo            1.0             7.0
4     plátano         3    0.35  rojo            7.0             3.5
6     naranja         4    0.15  rojo            5.0             6.0

El método `.nsmallest()` nos devuelve las $n$ filas con menor valor de la columna que indiquemos por parámetro

In [49]:
# Queremos las 3 observaciones con menor precio
# queremos los 3 menores valores de la columna PRECIO, en orden ascendente
df.nsmallest(3, "PRECIO")

        FRUTA  CANTIDAD  PRECIO COLOR  RANKING_FRUTA  RANKING_PRECIO
obs8   fresas        10    0.05  rojo            2.0             8.0
3     cerezas        10    0.10  rojo            1.0             7.0
6     naranja         4    0.15  rojo            5.0             6.0

El método `.largest()` nos devuelve las $n$ filas con mayor valor de la columna que indiquemos por parámetro

In [50]:
# Queremos las 5 observaciones con mayor cantidad
df.nlargest(5, "CANTIDAD")

        FRUTA  CANTIDAD  PRECIO COLOR  RANKING_FRUTA  RANKING_PRECIO
3     cerezas        10    0.10  rojo            1.0             7.0
obs8   fresas        10    0.05  rojo            2.0             8.0
2     manzana         6    0.35  rojo            3.0             3.5
5        pera         6    0.20  rojo            6.0             5.0
6     naranja         4    0.15  rojo            5.0             6.0

El método `.dtypes` nos indica de qué tipo es cada columna del dataframe

In [51]:
df.dtypes
# object, para elementos que tienen hetegeneidad de los elementos que contiene, strings, ints, floats, etc.
# RANKING es float porque en caso de empates genera valores decimales, si supieramos que no hay empates podemos convertirlo a int

FRUTA              object
CANTIDAD            int64
PRECIO            float64
COLOR              object
RANKING_FRUTA     float64
RANKING_PRECIO    float64
dtype: object

## Bucles y dataframes

Para iterar sobre las filas de un dataframe, podemos utilizar los métodos:

- `.iterrows()`
- `.itertuples()`

In [ ]:
d = {"name": ["Juan Gabriel", "María", "Ricardo"],
     "surname": ["Gomila", "Santos", "Alberich"],
     "gender": ["m", "f", "m"]}

df = pd.DataFrame(d)
df # 3 filas

           name   surname gender
0  Juan Gabriel    Gomila      m
1         María    Santos      f
2       Ricardo  Alberich      m

Usamos `.iterrows()` para obtener el índice de cada fila junto al contenido de cada una:

In [ ]:
# i, indice de la fila
# j, contenido de la fila, clave valor para cada campo de la fila
for i, j in df.iterrows():
  print("Índice de la fila: {},\n\nContenido de la fila:\n{}".format(i, j), end = "\n\n\n")
# imprimimos cada fila

Índice de la fila: 0,

Contenido de la fila:
name       Juan Gabriel
surname          Gomila
gender                m
Name: 0, dtype: object


Índice de la fila: 1,

Contenido de la fila:
name        María
surname    Santos
gender          f
Name: 1, dtype: object


Índice de la fila: 2,

Contenido de la fila:
name        Ricardo
surname    Alberich
gender            m
Name: 2, dtype: object

Usamos `.itertuples()` para obtener una tupla con toda la información de cada fila:

In [ ]:
# imprimimos en formato de tupla, i recorre cada fila
for i in df.itertuples():
  print("Contenido de la fila:\n{}".format(i), end = "\n\n")

Contenido de la fila:
Pandas(Index=0, name='Juan Gabriel', surname='Gomila', gender='m')

Contenido de la fila:
Pandas(Index=1, name='María', surname='Santos', gender='f')

Contenido de la fila:
Pandas(Index=2, name='Ricardo', surname='Alberich', gender='m')

Para iterar sobre las columnas de un dataframe, 

- creamos una lista de las columnas del dataframe y luego iterarmos sobre esa lista para obtener la información de esas columnas
- usamos el métood `.iteritems()`

Creamos la lista de columnas e iteramos sobre esta:

In [52]:
# podemos usar esta forma para iterar las columnas. Se creo una lista
columns = list(df)
print(columns)

['FRUTA', 'CANTIDAD', 'PRECIO', 'COLOR', 'RANKING_FRUTA', 'RANKING_PRECIO']

In [ ]:
# iteramos la lista de columnas, esta es una forma más sencilla
for c in columns:
  print("Columna {}:\n{}".format(c, df[c]), end = "\n\n")

Columna name:
0    Juan Gabriel
1           María
2         Ricardo
Name: name, dtype: object

Columna surname:
0      Gomila
1      Santos
2    Alberich
Name: surname, dtype: object

Columna gender:
0    m
1    f
2    m
Name: gender, dtype: object

Podemos usar esta alternativa `.iteritems()` para obtener el nombre de cada columna junto al contenido de cada una:

In [ ]:
# se puede iterar con este método, aunque el anterior parece más sencillo
# i seria el nombre de la columna y la j seria el contenido
for i, j in df.iteritems():
  print("Nombre de la columna: {},\n\nContenido de la columna:\n{}".format(i, j), end = "\n\n\n")

Nombre de la columna: name,

Contenido de la columna:
0    Juan Gabriel
1           María
2         Ricardo
Name: name, dtype: object


Nombre de la columna: surname,

Contenido de la columna:
0      Gomila
1      Santos
2    Alberich
Name: surname, dtype: object


Nombre de la columna: gender,

Contenido de la columna:
0    m
1    f
2    m
Name: gender, dtype: object

## Dataframes a partir de archivos CSV

Podemos guardar la información de un archivo csv en un dataframe usando la función `read_csv()`.

El archivo puede

- estar guardado en nuestro directorio de trabajo
- proceder de una url

### Desde directorio de trabajo (con Google Drive)

Vamos a cargar el archivo llamado `characters-simpsons.csv` que tenemos guardado en la carpeta datasets de Google Drive.

Para ello, lo primero que tenemos que hacer es conectar este notebook de Colab con Google Drive. Debemos darle acceso al colab a nuestro archivos de Google Drive, se explica en el video 019 minuto 2:20

A continuación, navegamos por nuestro Google Drive hasta encontrar el archivo csv en cuestión. De sus opciones, seleccionamos copiar ruta. Esa ruta será la que pasemos por parámetro a la función `read_csv()`

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
simpsons_df = pd.read_csv("/content/drive/MyDrive/python-basico/datasets/characters-simpsons.csv")
simpsons_df.head()
# valores NaN porque no tenemos esa data o el genero no se conoce

   id              name   normalized_name gender
0   7          Children          children    NaN
1  12  Mechanical Santa  mechanical santa    NaN
2  13        Tattoo Man        tattoo man    NaN
3  16  DOCTOR ZITSOFSKY  doctor zitsofsky    NaN
4  20          Students          students    NaN

In [ ]:
simpsons_df.tail()

        id             name  normalized_name gender
6717  5222   Ron Rabinowitz   ron rabinowitz      m
6718  5728   Martha Stewart   martha stewart      f
6719  1770  Officer Goodman  officer goodman      m
6720  1634     Evan Conover     evan conover      m
6721  1868    Agent Johnson    agent johnson      m

### Desde url

Vamos a cargar el archivo que contiene la frecuencia de aparición de las letras del alfabeto inglés. Este archivo se llama letter_frequency.csv procede de la siguiente [url](https://people.sc.fsu.edu/~jburkardt/data/csv/letter_frequency.csv)

In [ ]:
letters_freq_df = pd.read_csv("https://people.sc.fsu.edu/~jburkardt/data/csv/letter_frequency.csv")
# debemos asegurarnos de que el archivo no esta incrustado en una pagina web, si viene de github debemos hacer click en RAW para leerlo correctamente
letters_freq_df.columns = ["Letra", "Frecuencia", "Porcentaje"] 
letters_freq_df

      Letra  Frecuencia  Porcentaje
0       "A"    24373121         8.1
1       "B"     4762938         1.6
2       "C"     8982417         3.0
3       "D"    10805580         3.6
4       "E"    37907119        12.6
5       "F"     7486889         2.5
6       "G"     5143059         1.7
7       "H"    18058207         6.0
8       "I"    21820970         7.3
9       "J"      474021         0.2
10      "K"     1720909         0.6
11      "L"    11730498         3.9
12      "M"     7391366         2.5
13      "N"    21402466         7.1
14      "O"    23215532         7.7
15      "P"     5719422         1.9
16      "Q"      297237         0.1
17      "R"    17897352         5.9
18      "S"    19059775         6.3
19      "T"    28691274         9.5
20      "U"     8022379         2.7
21      "V"     2835696         0.9
22      "W"     6505294         2.2
23      "X"      562732         0.2
24      "Y"     5910495         2.0
25      "Z"       93172         0.0

## Dataframes a partir de archivos JSON

Podemos guardar la información de un archivo json en un dataframe usando el método `.read_json()`.

El archivo puede

- estar guardado en nuestro directorio de trabajo
- proceder de una url

### Desde directorio de trabajo (con Google Drive)

Vamos a cargar el archivo llamado `json_index_example.json` que tenemos guardado en la carpeta datasets de Google Drive.

Para ello, lo primero que tenemos que hacer es conectar este notebook de Colab con Google Drive.

A continuación, navegamos por nuestro Google Drive hasta encontrar el archivo json en cuestión. De sus opciones, seleccionamos copiar ruta. Esa ruta será la que pasemos por parámetro al método `.read_json()`

In [ ]:
import pandas as pd
quiz_index = pd.read_json("/content/drive/MyDrive/python-basico/datasets/json_index_example.json", 
                          orient = "index")
# index por que los valores estan diseñados por indice(fila), es decir, es un json con muchos registros
# {0:{"nombre":"","apellido":""},1:{"nombre":"","apellido":""},2:{"nombre":"","apellido":""}}
quiz_index.head()

    Producto  Precio  Cantidad
0  Bolígrafo    1.80         3
1      Lápiz    0.30         2
2    Libreta    5.20         1
3     Agenda    9.99         1
4  Rotulador    1.15         5

#### El parámetro `orient`

En el caso de archivos json, podría darse que no tuvieran la misma configuración que nuestro ejemplo, `json_index_example.json` cuya orientación se corresponde con `index`.

El parámetro `orient` del método `.read_json()` admite otras opciones como `columns` o `values`.

Veamos ambos casos con los ficheros `json_columns_example.json` y `json_values_example.json`, respectivamente.

In [ ]:
# Orientación con index
quiz_columns = pd.read_json("/content/drive/MyDrive/python-basico/datasets/json_columns_example.json", 
                    orient = "columns")
# el json esta orientado a columnas
# {"producto":{"0":"","1":"","2":""},"precio":{"0":"","1":"","2":""},"cantidad":{"0":"","1":"","2":""}}
quiz_columns.head()

    Producto  Precio  Cantidad
0  Bolígrafo    1.80         3
1      Lápiz    0.30         2
2    Libreta    5.20         1
3     Agenda    9.99         1
4  Rotulador    1.15         5

In [ ]:
# Orientación con values
quiz_values = pd.read_json("/content/drive/MyDrive/python-basico/datasets/json_values_example.json",
                           orient = "values")
# el json viene en un arreglo y cada elemento es un arreglo, las filas y columnas no tendrán nombres
# [["Bolígrafo","1.80","3"],["Lápiz","1.80","3"],["Libreta","1.80","3"]]
# aunque este formato puede funcionar con orient = "columns", porque no necesitamos definir nombres para las columnas

quiz_values.head()

           0     1  2
0  Bolígrafo  1.80  3
1      Lápiz  0.30  2
2    Libreta  5.20  1
3     Agenda  9.99  1
4  Rotulador  1.15  5

### Desde url

Vamos a cargar el archivo json que procede de la siguiente [url](https://api.exchangerate-api.com/v4/latest/USD)

In [ ]:
# esta es una api, retorna el valor del dolar(USD, que podemos cambiar por otra moneda) con su conversión en otras monedas
# por defecto es orient = "index"
from_url = pd.read_json("https://api.exchangerate-api.com/v4/latest/USD")
from_url.head()
# rate es el valor de la moneda para un dolar

    base       date  time_last_updated      rates
AED  USD 2021-02-14         1613260801   3.672500
ARS  USD 2021-02-14         1613260801  88.385195
AUD  USD 2021-02-14         1613260801   1.290432
BGN  USD 2021-02-14         1613260801   1.613399
BRL  USD 2021-02-14         1613260801   5.382740

## Tratamiento de datos faltantes

Los datos faltantes, o en inglés, Missing Data, se dan cuando no hay información para uno o más elementos.

Éste es un problema muy común en la vida real.

En la librería `pandas`, identificamos los missing data con valores `NA` (Not Available)(no disponible) o `NaN` (Not a Number)(valor no númerico).

Para identificar valores fanltantes en un dataframe de `pandas` , podemos usar los métodos `.isnull()` o `.notnull()`

In [ ]:
# Nos devuelve True allí donde hay un dato faltante
simpsons_df.isnull().head()

      id   name  normalized_name  gender
0  False  False            False    True
1  False  False            False    True
2  False  False            False    True
3  False  False            False    True
4  False  False            False    True

In [ ]:
# Nos devuelve False allí donde hay un dato faltante
simpsons_df.notnull().head()

     id  name  normalized_name  gender
0  True  True             True   False
1  True  True             True   False
2  True  True             True   False
3  True  True             True   False
4  True  True             True   False

Existen muchas técnicas para tratar con valores faltantes: se sustituyen por la media, por la mediana, se elimina la observación, se interpolan... nosotros no entraremos en detalle en ese aspecto. Simplemente veremos los métodos de `Python` que podemos utilizar para tratar con valores faltantes:

- `.fillna()`
- `.replace()`
- `.interpolate()`
- `.dropna()`

El método `.fillna()` sustituye los valores faltantes por el valor que indiquemos por parámetro

In [53]:
# Necesitamos la librería numpy para crear un dataframe con valores NaN
import numpy as np

In [54]:
# np.nan es un valor NaN
data = {"Primer lanzamiento": [100, 86, np.nan, 75, 97],
        "Segundo lanzamiento": [80, np.nan, 63, 81, 88],
        "Tercer lanzamiento": [93, 89, 92, 97, np.nan]
        }

points_df = pd.DataFrame(data, index = ["Jugador 1", "Jugador 2", "Jugador 3", "Jugador 4", "Jugador 5"])
points_df

           Primer lanzamiento  Segundo lanzamiento  Tercer lanzamiento
Jugador 1               100.0                 80.0                93.0
Jugador 2                86.0                  NaN                89.0
Jugador 3                 NaN                 63.0                92.0
Jugador 4                75.0                 81.0                97.0
Jugador 5                97.0                 88.0                 NaN

In [55]:
# Sustituimos todos los NaN por 0 puntos
points_df.fillna(0)

           Primer lanzamiento  Segundo lanzamiento  Tercer lanzamiento
Jugador 1               100.0                 80.0                93.0
Jugador 2                86.0                  0.0                89.0
Jugador 3                 0.0                 63.0                92.0
Jugador 4                75.0                 81.0                97.0
Jugador 5                97.0                 88.0                 0.0

Para sustituir valores faltantes con el método `.replace()` lo hacemos del siguiente modo: primero pasamos por parámetro el valor que queremos sustituir y luego, el valor por el cual queremos sustituirlo.

In [56]:
points_df = pd.DataFrame(data, index = ["Jugador 1", "Jugador 2", "Jugador 3", "Jugador 4", "Jugador 5"])
points_df.replace(np.nan, 0) # queremos que reemplace los NaN por 0

           Primer lanzamiento  Segundo lanzamiento  Tercer lanzamiento
Jugador 1               100.0                 80.0                93.0
Jugador 2                86.0                  0.0                89.0
Jugador 3                 0.0                 63.0                92.0
Jugador 4                75.0                 81.0                97.0
Jugador 5                97.0                 88.0                 0.0

Si usamos el método `.interpolate()`, sustituiremos los valores `NaN` por valores interpolados. Este método consta de muchos parámetros para elegir el método (que por defecto es `linear`) por el cual llevar a cabo la interpolación.

In [ ]:
points_df = pd.DataFrame(data, index = ["Jugador 1", "Jugador 2", "Jugador 3", "Jugador 4", "Jugador 5"])
points_df.interpolate()
# la interpolación lineal consiste en coger el valor anterior y posterior an registro NaN, promediar los valores y reemplazarlo por NaN
# el 1er lanzamiento del juagador 3 es el promedio de 86.0 y 75.0 del jugador 2 y 4 en su 1er lanzamiento
# esto talvez no sea tan conveniente, puede que los valores antes y despues no tengan relación y no tengamos un dato bueno
# lo mejor es evaluar el caso. En datos de tiempo quiza pueda servir

           Primer lanzamiento  Segundo lanzamiento  Tercer lanzamiento
Jugador 1               100.0                 80.0                93.0
Jugador 2                86.0                 71.5                89.0
Jugador 3                80.5                 63.0                92.0
Jugador 4                75.0                 81.0                97.0
Jugador 5                97.0                 88.0                97.0

El método `.dropna()` elimina las filas que contienen valores faltantes, solo tener una columna con un valor NaN hace que se elimina la fila.

In [ ]:
points_df = pd.DataFrame(data, index = ["Jugador 1", "Jugador 2", "Jugador 3", "Jugador 4", "Jugador 5"])
points_df.dropna()

           Primer lanzamiento  Segundo lanzamiento  Tercer lanzamiento
Jugador 1               100.0                 80.0                93.0
Jugador 4                75.0                 81.0                97.0

## Filtrando dataframes

Dado un dataframe, podemos filtrar sus filas comprobando cuáles satisfacen una condición

In [ ]:
# Mostramos las observaciones con porcentaje mayor a 5
# solo retorna las filas tienen true en la condición
letters_freq_df[letters_freq_df["Porcentaje"] > 5]

      Letra  Frecuencia  Porcentaje
0       "A"    24373121         8.1
4       "E"    37907119        12.6
7       "H"    18058207         6.0
8       "I"    21820970         7.3
13      "N"    21402466         7.1
14      "O"    23215532         7.7
17      "R"    17897352         5.9
18      "S"    19059775         6.3
19      "T"    28691274         9.5

In [ ]:
# Mostramos las observaciones con frecuencia menor o igual a la de la letra S
# en la fila 18 se encuentra la letra S y obtenmos el valor de la columan frecuencia
freq_S = letters_freq_df.loc[18, "Frecuencia"]
# valores menores e iguales que la frecuencia S
letters_freq_df[letters_freq_df["Frecuencia"] <= freq_S]

      Letra  Frecuencia  Porcentaje
1       "B"     4762938         1.6
2       "C"     8982417         3.0
3       "D"    10805580         3.6
5       "F"     7486889         2.5
6       "G"     5143059         1.7
7       "H"    18058207         6.0
9       "J"      474021         0.2
10      "K"     1720909         0.6
11      "L"    11730498         3.9
12      "M"     7391366         2.5
15      "P"     5719422         1.9
16      "Q"      297237         0.1
17      "R"    17897352         5.9
18      "S"    19059775         6.3
20      "U"     8022379         2.7
21      "V"     2835696         0.9
22      "W"     6505294         2.2
23      "X"      562732         0.2
24      "Y"     5910495         2.0
25      "Z"       93172         0.0

El método `.query()` nos puede ser útil para este cometido, pero funciona únicamente cuando los valores de la columna no contienen espacios en blanco.

In [ ]:
# Mostramos aquellas observaciones cuyo porcentaje es mayor a 5
# la columna debe ser una sola palabra o unido por guiones o todas las palabras juntas
# esto es un poco más facil de leer que lo anterior como con SQL, Aunque hacen lo mismo.
letters_freq_df.query('Porcentaje > 5')

      Letra  Frecuencia  Porcentaje
0       "A"    24373121         8.1
4       "E"    37907119        12.6
7       "H"    18058207         6.0
8       "I"    21820970         7.3
13      "N"    21402466         7.1
14      "O"    23215532         7.7
17      "R"    17897352         5.9
18      "S"    19059775         6.3
19      "T"    28691274         9.5

In [ ]:
# Mostramos aquellas observaciones cuyo porcentaje es mayor a 5 y menor o igual a 8
# podemos añadir operadores logicos a las condiciones
letters_freq_df.query("Porcentaje > 5 and Porcentaje <= 8")

      Letra  Frecuencia  Porcentaje
7       "H"    18058207         6.0
8       "I"    21820970         7.3
13      "N"    21402466         7.1
14      "O"    23215532         7.7
17      "R"    17897352         5.9
18      "S"    19059775         6.3

## Series de `pandas`

**Serie.** Una Serie de `pandas` es como una columna de un dataframe.

Podemos construir Series de `pandas` a partir de una lista unidimensional

In [ ]:
# series es un tipo de dato en pandas, se le pueden aplicar algunos los métodos de las listas en python
# parecidos a las listas o arreglos de numpy pero son tipos distintos
# se puede construir a partir de una lista como lo hacemos ahora
a = [1, 2, 3, 4, 5]
my_series = pd.Series(a) # le pasamos la lista
print(my_series) # vemos que se convierte en columna y tiene un indice por fila
# además nos muestra el tipo de datos de la columna que es int64, escoge el tipo de dato más pequeño que englobe a los datos

0    1
1    2
2    3
3    4
4    5
dtype: int64

**Observación.** Si no especificamos nada, por defecto las etiquetas de las entradas de la Serie se corresponden con el índice que ocupan. Recordemos que en `Python` lo índices empiezan por 0.

Estas etiquetas pueden ser usadas para acceder a un valor específico

In [ ]:
print(my_series[1]) # los valores tienen un indice y podemos acceder a ellas por ese indice.

2

Cuando creamos una Serie, podemos modificar sus etiquetas con el parámetro `index`:

In [ ]:
my_series = pd.Series(a, index = ["a", "b", "c", "d", "e"]) # podemos agregar valores al indice
print(my_series)
# podemos colocar indices iguales, nos lo acepta, pero es mala práctica pudiendo llevar a problemas más adelante si queremos

a    1
b    2
c    3
d    4
e    5
dtype: int64

Ahora, para acceder a una entrada en particular, lo haremos con las nuevas etiquetas:

In [ ]:
print(my_series["c"]) # accedemos de igual forma por medio del indice
# si tuvieramos dos valores con indice "c", nos devuelve esos dos valores

3

Su uso común son en series temporales donde el índice seria una fecha en especifico y almacenaran un valor como °T, tipo de cambio ese día, etc.

También podemos crear Series a partir de diccionarios. En este caso, las claves se corresponderán con las etiquetas de las series, y los valores del diccionario con los valores que toman las entradas de la Serie.

In [57]:
# las claves serán el indice de la serie y los valores son los valores de la serie
videos = {"day1": 5, "day2": 9, "day3": 7, "day4": 6, "day5": 8}
my_series = pd.Series(videos)
print(my_series)

day1    5
day2    9
day3    7
day4    6
day5    8
dtype: int64

In [58]:
print(my_series["day1"])

5

Es mejor manejar los datos en Data Frames que en Series, porque no deja de ser muy similar a una columna de data frame y si tienemos varias Series lo ideal es juntarlas en un solo dataframe. En la mayoria de algoritmos de Machine Learning se usan dataframe y pasar una Serie causa errores.